title: Rule fake
id: c37510b8-2107-4b78-aa32-72f251e7a84453485349
status: experimental
description: Just test
author: lamntse63326
date: 2020/7/16
references:
    - https://app.any.run/tasks/d860402c-3ff4-4c1f-b367-0237da714ed1/
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: 'overwritten.exe'
    condition: selection
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Unlikely
level: critical
